app/controllers/todos_controller.rb

INSERT INTO "todos" ("description", "complleted", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "hola"], ["complleted", "chao"], ["created_at", "2019-01-30 02:46:45.703247"], ["updated_at", "2019-01-30 02:46:45.703247"]]
---
  def create
    @todo = Todo.new(todo_params)
    @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @todo = Todo.find(params[:id])

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "description" = ?, "complleted" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["description", "hola que tal"], ["complleted", "soy sebastian"], ["updated_at", "2019-01-30 04:08:33.606108"], ["id", 1]]
---
  def update
    @todo = Todo.find(params[:id])
    @todo.update(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "todos" SET "complleted" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["complleted", "t"], ["updated_at", "2019-01-30 23:26:11.404183"], ["id", 26]]
---
  def complete
    @todo = Todo.find(params[:id])
    @todo.update(complleted: true)

SELECT "todos".* FROM "todos" WHERE "todos"."complleted" = ?  [["complleted", 1]]
---
  def list
    @todo = Todo.all
    @completed = Todo.where(complleted: true)